package com.spider.order.util;

public class Constant {
    public final static String order1 = "1[땡겨요] 주문 전표 (고객용)0포장 T22K03PP6GF\n" +
            "0결제완료1------------------------------------------\n" +
            "0[고객 연락처]\n" +
            "1010-4578-42070※고객정보도용시 법적책임을 받을수있습니다\n" +
            "1------------------------------------------\n" +
            "0[가게 사장님에게]\n" +
            "0다회용기 (식사 후 수거)0일회용 수저, 포크 안 주셔도 돼요!1------------------------------------------\n" +
            "1메뉴명                    수량        금액\n" +
            "1------------------------------------------\n" +
            "0토핑그릭요거트               1       7,8000 + 토핑그릭요거트  (7,800)\n" +
            "0 + 지리산 벌꿀스틱 (x)\n" +
            "0 + 퓨어(기본)\n" +
            "0초록밭 샐러드                1      13,8000 + 초록밭 샐러드  (10,800)\n" +
            "0 + 유자발사믹(기본)  \n" +
            "0 + 곤약현미밥(100g)/샐러드포함제공  (2,000)\n" +
            "0 + 로제(1,000)\n" +
            "1------------------------------------------\n" +
            "2총 주문금액                         21,600\n" +
            "2배달비                                   0\n" +
            "1------------------------------------------\n" +
            "2총 결제금액                         20,6001------------------------------------------\n" +
            "1※상세내역은 배달앱주문상세에서 확인하세요\n" +
            "1------------------------------------------\n" +
            "0[원산지 표시]\n" +
            "0돼지고기(국내산), 닭고기(국내산), 고춧가루(국내산), 두부(국내산), 현미(국내산), 새우(베트남산)\n" +
            "1------------------------------------------\n" +
            "0초록밭 샐러드&그릭요거트 전문점(1003529)\n" +
            "02022.11.03 09:52\n" +
            "2[땡겨요]";

    public final static String order2 = "8coupang eats    [고객용]\n" +
            "----------------------------------------\n" +
            "       08V3R0       \n" +
            "\n" +
            "오늘 행사 때문에 1회용 물티슈 22장 정도 \n" +
            "            부탁 드려요 ㅠㅠ            \n" +
            "----------------------------------------\n" +
            "메뉴                       수량     금액\n" +
            "----------------------------------------\n" +
            "프리미엄 샤인머스켓           1    8,500\n" +
            "+ 500g                        1    7,500\n" +
            "\n" +
            "프리미엄 샤인머스켓           1    8,500\n" +
            "+ 250g                        1        0\n" +
            "\n" +
            "고당도 머스크 멜론            1    8,500\n" +
            "+ 600g                        1    7,500\n" +
            "\n" +
            "고당도 머스크 멜론            1    8,500\n" +
            "+ 300g                        1        0\n" +
            "\n" +
            "천중도 털 복숭아              3   22,500\n" +
            "+ 3개컷팅(껍질제거)           3   10,500\n" +
            "........................................\n" +
            "주문금액                          82,000\n" +
            "배달비                             4,900\n" +
            "........................................\n" +
            "카드결제                          86,900\n" +
            "----------------------------------------\n" +
            "총결제금액                        86,900\n" +
            "----------------------------------------\n" +
            "거래일시: 2021-09-13 09:55:16           \n" +
            "주문매장: 과일에반하다 프루타 신림점    \n" +
            "결제방식: 쿠페이 선결제 완료            \n" +
            "원산지 정보: 샤인머스캣 메론 딸기 토마토\n" +
            " 홍시 단감 방울토마토 국산 사파이어포도 \n" +
            " 청포도 적포도 오렌지 미국산 그린키위 골\n" +
            "드키위 뉴질랜드산                       \n" +
            "\n" +
            "      쿠팡이츠 고객센터 1670-9827";

    public final static String order3 = "배달 주문전표              \n" +
            "주문번호 OY3T                             \n" +
            "결제방식 후불카드                         \n" +
            "------------------------------------------\n" +
            "배달주소:\n" +
            "부산 부산진구 가야동 464-100 엄광로 182번길  25-3\n" +
            "부산 부산진구 엄광로182번길 25-3 엄광로 182번길  25-3\n" +
            "\n" +
            "연락처:\n" +
            "010-3433-0308\n" +
            "고객정보를 배달목적 외 사용하거나 보관, 공개할 경우 법적처벌을 받을 수 있습니다.\n" +
            "------------------------------------------\n" +
            "요청사항:                                 \n" +
            "가게 : 다자녀맘 콜라1.25리터주세요.혹시 소금 말고 기본 양념도 주시나요 (수저포크 X)\n" +
            "배달 : 연락주세요\n" +
            "------------------------------------------\n" +
            "메뉴명                     수량       금액\n" +
            "------------------------------------------\n" +
            "엄청 큰 후라이드 치킨      1        17,000\n" +
            " + 뼈\n" +
            "노랑 봉투 감자             1         8,000\n" +
            "배달팁                               2,000\n" +
            "------------------------------------------\n" +
            "합계(후불카드)                      27,000\n" +
            "------------------------------------------\n" +
            "주문번호:B11D01OY3T\n" +
            "2021.09.07 18:50";

    public final static String order4 = "사전결제 여부: O                 [고객용]\n" +
            " ┌------------------------------------┐ \n" +
            "             배민1주문 0 6 N D            \n" +
            " └------------------------------------┘ \n" +
            "------------------------------------------\n" +
            "배달주소 :\n" +
            "도촌동\n" +
            "배달주소 : 도촌동 주문 정보는 고객의 개\n" +
            "인 정보\n" +
            "*안심번호는 주문접수 후 최대 3시간 유효*\n" +
            "-------------------------------------\n" +
            "배달주소 : 도촌동 주문 정보는 고객의 개\n" +
            "인 정보\n" +
            "*안심번호는 주문접수 후 최대 3시간 유효*\n" +
            "-------------------------------------\n" +
            "배달주소 : 도촌동 주문 정보는 고객의 개\n" +
            "인 정보\n" +
            "*안심번호는 주문접수 후 최대 3시간 유효*\n" +
            "-------------------------------------\n" +
            "------------------------------------------\n" +
            "가게 요청사항: \n" +
            "(수저포크 O)\n" +
            "배달 요청사항: \n" +
            "문앞에 두고 벨 눌러주세요\n" +
            "------------------------------------------\n" +
            "메뉴                        수량      금액\n" +
            "------------------------------------------\n" +
            "후레쉬 연어 포케              1     15,900\n" +
            " +++하우스 폰즈 \n" +
            " +닭다리살 4,000원\n" +
            "------------------------------------------\n" +
            "합계 :                           15,900 원\n" +
            "------------------------------------------\n" +
            "     기본 배달팁(3,000) + 거리 할증(0)    \n" +
            "             총 배달팁 3,000원            \n" +
            "------------------------------------------\n" +
            "주문가게 : 헬스토랑\n" +
            "주문일시 : 2021-09-13(월) 10:44\n" +
            "주문번호 : T11J000006ND";

    public final static String order5 =
            "요기요\n" +
                    "주문 매장: 신림동정통계란말이김밥-마곡방화\n" +
                    "점\n" +
                    "주문 일시: 2021년09월13일(월) 오후01:54\n" +
                    "주문 번호: 21091313979934\n" +
                    "\n" +
                    "#208\n" +
                    "\n" +
                    "배달완료예정시간\n" +
                    "오후02:45\n" +
                    "------------------------------------------\n" +
                    "현장카드결제\n" +
                    "------------------------------------------\n" +
                    "배달 주소:\n" +
                    "서울특별시 강서구 마곡동 (방화1동) 734 마\n" +
                    "곡엠밸리1단지 102동302호\n" +
                    "연락처: 050447048404\n" +
                    "------------------------------------------\n" +
                    "일회용 수저, 포크 X\n" +
                    "------------------------------------------\n" +
                    "메뉴명                      수량      가격\n" +
                    "------------------------------------------\n" +
                    "메인 메뉴: 계란말이 김밥      2     12,000\n" +
                    "메인 메뉴: 떡볶이             1      3,500\n" +
                    "배달료:                              2,000\n" +
                    "------------------------------------------\n" +
                    "합계:        ￦17,500\n" +
                    "------------------------------------------";

    // 요기요 old2
    public final static String order6 = "요기요\n" +
            "주문 매장: 혜화동돈까스극장-화성시청점\n" +
            "주문 일시: 2021년10월05일(화) 오후07:14\n" +
            "주문 번호: 21100519662033\n" +
            "\n" +
            "#277\n" +
            "\n" +
            "배달완료예정시간\n" +
            "오후08:05\n" +
            "------------------------------------------\n" +
            "현장카드결제\n" +
            "------------------------------------------\n" +
            "배달 주소:\n" +
            "경기도 화성시 남양읍 (남양읍) 남양리 2249 \n" +
            "시티 프라디움2차아파트 206동401호\n" +
            "연락처: 050447334897\n" +
            "------------------------------------------\n" +
            "일회용 수저, 포크 X\n" +
            "------------------------------------------\n" +
            "메뉴명                      수량      가격\n" +
            "------------------------------------------\n" +
            "왕많은시리즈: 왕많은 돈까스   1      9,900\n" +
            "왕많은시리즈: 왕많은 통닭다   1      9,900\n" +
            "리까스                                    \n" +
            "쫄면메밀류: 살얼음 물쫄면     1      6,500\n" +
            "배달료:                              3,000\n" +
            "------------------------------------------\n" +
            "합계:        ￦29,300\n" +
            "------------------------------------------\n" +
            "원산지정보:\n" +
            "돈까스(돼지생등심) : 국내산 소고기(함박) :\n" +
            " 호주산 소고기(차돌박이/차돌양지) : 미국산\n" +
            " 돼지고기(함박/롤까스/코돈부르/만두/소떡소\n" +
            "떡) : 국내산 돼지고기(핫도그/페퍼로니) : \n" +
            "국내산 + 외국산 닭고기(치킨까스/닭볶이/ 후\n" +
            "라이드/만두/소떡소떡) : 국내산 닭고기(윙) \n" +
            ": 태국산 명태살: 러시아산 오징어 : 페루산 \n" +
            "꽃게 : 중국산 김치(배추/고춧가루) : 중국산\n" +
            " 쌀 : 국내산\n" +
            "------------------------------------------";

    // 요기요 new
    public final static String order7 = "[고객용]\n" +
            "요기요\n" +
            "------------------------------------------\n" +
            "주문 번호: #3837\n" +
            "결제 방법: 현장카드결제\n" +
            "------------------------------------------\n" +
            "요청 사항:\n" +
            "일회용 수저, 포크는 안 쓸게요.\n" +
            "------------------------------------------\n" +
            "배달 주소:\n" +
            "(도로명) 경기도 화성시 행정동로 83 향남시\n" +
            "범복사꽃마을상록하늘채아파트 808-1301\n" +
            "(지번) 경기도 화성시 향남읍 (향남읍) 행정\n" +
            "리 475 향남시범복사꽃마을상록하늘채아파트 \n" +
            "808-1301\n" +
            "------------------------------------------\n" +
            "연락처: 050447476109\n" +
            "------------------------------------------\n" +
            "메뉴명                      수량      가격\n" +
            "------------------------------------------\n" +
            "메인 메뉴: 반반족발           1     37,000\n" +
            "- 사이즈선택: 중              1           \n" +
            "배달료:                              1,000\n" +
            "------------------------------------------\n" +
            "합계:                               38,000\n" +
            "------------------------------------------\n" +
            "주문 매장: 육감만족-향남점\n" +
            "주문 번호: F2208241650JHZ9E\n" +
            "주문 일자: 2022년 08월 24일(수) 오후04:51";

    // 요기요 new 포장
    public final static String order8 = "[고객용]\n" +
            "요기요 포장\n" +
            "------------------------------------------\n" +
            "교환 코드: 73ZN0421R\n" +
            "결제 방법: 요기요결제완료\n" +
            "------------------------------------------\n" +
            "요청 사항:\n" +
            "일회용 수저, 포크는 안 쓸게요.\n" +
            "------------------------------------------\n" +
            "연락처: 01092183264\n" +
            "------------------------------------------\n" +
            "메뉴명                      수량      가격\n" +
            "------------------------------------------\n" +
            "셋트 메뉴(SAVINGS SET): [주   1      8,900\n" +
            "문수1위]한입강정 SET                      \n" +
            "- 강정: 케이준강정(소)        1           \n" +
            "- 버거 변경 선택: 버거운치킨  1           \n" +
            "버거(기본)                                \n" +
            "- 음료선택: 콜라(기본)        1           \n" +
            "------------------------------------------\n" +
            "합계:                                8,900\n" +
            "------------------------------------------\n" +
            "주문 매장: 버거운버거-천안두정점\n" +
            "주문 번호: F2208231650JEFA4\n" +
            "주문 일자: 2022년 08월 23일(화) 오후04:51\n" +
            "방문 시간: 2022년 08월 23일(화) 오후05:10\n" +
            "------------------------------------------";

    public final static String order9 = "";

    public final static String order10 = "";
}
